<template>
  <header></header>

  <div class="container">
    <h1>เริ่มเล่นอย่างรวดเร็ว</h1>
    <section>
      <h3 @click="shown.o1 = !shown.o1">
        1. ช่วงบัญชาการ - Command Phase
        <ion-icon v-if="shown.o1" name="caret-down-outline"></ion-icon>
        <ion-icon v-else name="caret-up-outline"></ion-icon>
      </h3>
      <div v-if="shown.o1">
        <p>
          <strong>บัญชาการ:</strong> เมื่อเริ่มช่วงนี้ผู้เล่นทั้งสองฝ่ายได้รับ 1 แต้มบัญชาการ
          (แต้มนี้สามารถใช้จ่ายเพื่อใช้ยุทธวิธี (Strategem) ในช่วงต่าง ๆ ระหว่างเล่น) และหลังจากนั้นทำตามระเบียบอื่น ๆ
          ที่สามารถใช้ได้ในช่วงนี้
        </p>
        <p>
          <strong>สั่นสะท้านจากการสู้รบ:</strong> ตรวจสอบทุกยูนิตของคุณที่เสียโมเดลเกินกว่าครึ่งของยูนิตนั้น
          (หรือเสียเลือดเกินกว่าครึ่งหนึ่งหากเป็นยูนิตที่มีโมเดล 1 ตัว) ทอย 2D6 หากได้ผลลัพท์น้อยกว่าค่า LD
          (ค่าความเป็นผู้นำ - Leadership) ที่แสดงอยู่บนตารางข้อมูลของยูนิต ยูนิตนั้นจะติดสถานะ "สั่นสะท้านจากการสู้รบ"
          ไปจนถึงช่วงบัญชาการหน้าของคุณ <br>
          ยูนิตที่ติดสถานะสั่นสะท้านจากการสู้รบจะมีค่า OC (ความสามารถในการยึดจุด - Objective Control) เป็น 0
          และไม่สามารถได้รับผลยุทธวิธีฝ่ายเดียวกันได้
        </p>
      </div>
    </section>

    <section>
      <h3 @click="shown.o2 = !shown.o2">
        2. ช่วงเคลื่อนที่ - Movement Phase

        <ion-icon v-if="shown.o2" name="caret-down-outline"></ion-icon>
        <ion-icon v-else name="caret-up-outline"></ion-icon>
      </h3>
      <div v-if="shown.o2">
        <p>
          ยูนิตที่ไม่ได้อยู่ในระยะ 1 นิ้วห่างจากโมเดลศัตรู (ระยะการปะทะ - Engagement Range) สามารถที่จะยืนนิ่ง (Remain
          Stationary) เดินปกติ (Normal Move) หรือวิ่งไปข้างหน้า (Advance Move)
        </p>
        <ul>
          <li>
            <strong>เดินปกติ:</strong> ขยับยูนิตเป็นระยะทางเท่ากับค่า MV (การขยับ - Move)
            โดยจะไม่อยู่ในระยะการปะทะของโมเดลศัตรูเมื่อขยับเสร็จ
          </li>
          <li>
            <strong>วิ่งไปข้างหน้า:</strong> เหมือนข้างบน แต่ให้ทอยลูกเต๋า 1D6 และเพิ่มระยะการขยับเท่ากับผลลัพท์ที่ได้
            ยูนิตที่วิ่งไปข้างหน้าจะไม่สามารถยิงได้ (ยกเว้นมีอาวุธ "จู่โจม") หรือเข้าปะทะได้ในรอบนี้
          </li>
        </ul>
        <p>
          ยูนิตที่อยู่ในระยะการปะทะของโมเดลศัตรูจะสามารถทำได้แค่อยู่นิ่ง ๆ หรือถอยหนี (Fall Back)
        </p>
        <ul>
          <li>
            <strong>ถอยหนี:</strong> เหมือนกับการเดินปกติ แต่ยูนิตที่ถอยหนีจะไม่สามารถยิง หรือเข้าปะทะได้ในรอบนี้
          </li>
        </ul>
      </div>
    </section>

    <section>
      <h3 @click="shown.o3 = !shown.o3">
        3. ช่วงการยิง - Shooting Phase

        <ion-icon v-if="shown.o3" name="caret-down-outline"></ion-icon>
        <ion-icon v-else name="caret-up-outline"></ion-icon>
      </h3>
      <div v-if="shown.o3">
        <p>
          ยิงทีละยูนิต โมเดลของคุณจะสามารถยิงอาวุธระยะไกลใส่ยูนิตศัครูที่อยู่ในระยะยิง และสามารถบอกเห็นได้
          โมเดลที่มีอาวุธระยะไกลมากกว่า 1 อย่าง สามารถยิงไปที่เป้าหมายแตกต่างกันได้แต่ต้องระบุเป้าหมายทั้งหมดก่อนเริ่มยิง
        </p>
        <p>อาวุธจะมีตารางข้อมูลดังนี้</p>
        <table>
          <thead>
            <td class="name leftAlign">อาวุธระยะไกล</td>
            <td class="range">ระยะ</td>
            <td class="a">A</td>
            <td class="bs">BS</td>
            <td class="s">S</td>
            <td class="ap">AP</td>
            <td class="d">D</td>
          </thead>
          <tbody>
            <tr>
              <td class="name leftAlign">ปืนโบลต์ <span>[ปืนพก]</span></td>
              <td class="range">12"</td>
              <td class="a">1</td>
              <td class="bs">3+</td>
              <td class="s">4</td>
              <td class="ap">0</td>
              <td class="d">1</td>
            </tr>
          </tbody>
        </table>

        <table>
          <thead>
            <td class="name leftAlign">อาวุธระยะใกล้</td>
            <td class="range">ระยะ</td>
            <td class="a">A</td>
            <td class="bs">BS</td>
            <td class="s">S</td>
            <td class="ap">AP</td>
            <td class="d">D</td>
          </thead>
          <tbody>
            <tr>
              <td class="name leftAlign">มีดโซ่ของอัสตาร์ตีส</td>
              <td class="range">ใกล้</td>
              <td class="a">5</td>
              <td class="bs">3+</td>
              <td class="s">4</td>
              <td class="ap">-1</td>
              <td class="d">1</td>
            </tr>
          </tbody>
        </table>
        <div class="2col">
          <div class="left">
            <p>
              <strong>ระยะ:</strong>
              ความไกลของอาวุธที่จะยิงได้ คุณสามารถเลือกยิงโมเดลศัตรูได้ถ้าอยู่ภายในระยะ
              และโมเดลของคุณสามารถมองเห็นเป้าหมายได้
            </p>
            <p>
              <strong>A (การโจมตี - Attack):</strong>
              จำนวนที่อาวุธจะยิงหรือตี ซึ่งจะแทนด้วยจำนวนลูกเต๋า D6 ที่คุณจะโยนในตอนโจมตี
            </p>
            <p>
              <strong>BS (ทักษะการยิง - Balistic Skill):</strong>
              ความแม่นยำของการโจมตี ถ้าการทอยโดน (Hit Roll) เท่ากับหรือมากกว่าค่านี้ การโจมตีสำเร็จ!
            </p>
            <p>
              <strong>S (ความแข็งแกร่ง - Strength):</strong>
              เมื่อโจมตีสำเร็จ การโจมตีจะต้องแข็งแกร่งพอที่จะทำร้ายศัตรูได้
            </p>
            <p>
              <strong>AP (การเจาะเกราะ - Armor Penetration):</strong>
              ค่านี้หมายถึงความสามารถในการโจมตีเข้าไปที่เกราะป้องกันของศัตรู
            </p>
            <p>
              <strong>D (ความเสียหาย - Damage):</strong>
              ถ้าศัครูไม่สามารถทอยการหลบได้ (Saving Throw) การโจมตีจะทำความเสียหายต่อศัตรูตามค่านี้
            </p>
          </div>
        </div>
        <h4>การเริ่มโจมตี</h4>
        <p>ใช้ลำดับต่อไปนี้เพื่อทำการโจมตีในแต่ละครั้ง</p>
        <ul>
          <li>
            <strong>1. ทอยโดน (Hit Roll)</strong> <br>
            ทอยเต๋า D6 จำนวนตามค่า A โดยให้ได้ผลลัพท์มากกว่าหรือเท่ากับค่า BS ถ้าหากทอยได้ 6
            โดยไม่มีการปรับเปลี่ยนหมายความว่าการโจมตีนี้โดนจุดสำคัญ (Critical Hit) และจะถือว่าเป็นการโจมตีสำเร็จอัตโนมัติ
          </li>
          <li>
            <strong>2. ทอยบาดเจ็บ (Wound Roll)</strong> <br>
            เปรียบเทียบค่าความแข็งแกร่ง (Strength) ของอาวุธที่โจมตีกับค่าความทนทาน (Toughness) ของโมเดลเป้าหมาย
            และดูตารางด้านล่าง ถ้าหากทอยได้ 6
            โดยไม่มีการปรับเปลี่ยนหมายความว่าบาดเจ็บอย่างรุนแรง (Critical Wound) และจะถือว่าเป็นการบาดเจ็บอัตโนมัติ
          </li>
        </ul>

        <table>
          <thead>
            <td class="leftAlign">ความแข็งแกร่ง VS ความทนทาน</td>
            <td>ผลลัพท์ของ D6</td>
          </thead>
          <tbody>
            <tr>
              <td class="leftAlign">
                ความแข็งแกร่งมีค่า<span class="red">มากกว่าหรือเท่ากับสองเท่า</span>ของค่าความทนทาน
              </td>
              <td>
                2+
              </td>
            </tr>
            <tr>
              <td class="leftAlign">
                ความแข็งแกร่งมีค่า<span class="red">มากกว่า</span>ค่าความทนทาน
              </td>
              <td>
                3+
              </td>
            </tr>
            <tr>
              <td class="leftAlign">
                ความแข็งแกร่งมีค่า<span class="red">เท่ากับ</span>ค่าความทนทาน
              </td>
              <td>
                4+
              </td>
            </tr>
            <tr>
              <td class="leftAlign">
                ความแข็งแกร่งมีค่า<span class="red">น้อยกว่า</span>ค่าความทนทาน
              </td>
              <td>
                5+
              </td>
            </tr>
            <tr>
              <td class="leftAlign">
                ความแข็งแกร่งมีค่า<span class="red">ครึ่งหนึ่งหรือน้อยกว่าครึ่งหนึ่ง</span>ของค่าความทนทาน
              </td>
              <td>
                6+
              </td>
            </tr>
          </tbody>
        </table>
        <ul>
          <li>
            <strong>3. จัดสรรการโจมตี (Allocate Attack)</strong> <br>
            ศัตรูของคุณจะเลือกว่าโมเดลใดบ้างในยูนิตนั้นจะบาดเจ็บ (หากมีโมเดลไหนบาดเจ็บอยู่ก่อนแล้ว
            การโจมตีจะต้องถูกจัดไปที่ยูนิตนั้นก่อน)
          </li>
          <li>
            <strong>4. การทอยหลบ (Saving Throw)</strong> <br>
            ศัตรูของคุณจะทอยลูกเต๋า D6 หนึ่งลูก ลบผลลัพท์ที่ได้กับค่า AP ของอาวุธ
            ถ้าหากผลลัพท์สุดท้ายได้เท่ากับหรือมากกว่าค่า SV ของโมเดล การโจมตีจะไร้ผล แต่ถ้าไม่
            การโจมตีจะทำความเสียหายกับโมเดลนั้น
          </li>
          <li>
            <strong>5. การทำความเสียหาย (Inflict Damage)</strong> <br>
            โมเดลจะบาดเจ็บตามค่าความเสียหายของอาวุธนั้น
          </li>
        </ul>
      </div>
    </section>

    <section>
      <h3 @click="shown.o4 = !shown.o4">
        4. ช่วงเข้าปะทะ - Charge Phase
        <ion-icon v-if="shown.o4" name="caret-down-outline"></ion-icon>
        <ion-icon v-else name="caret-up-outline"></ion-icon>
      </h3>
      <div v-if="shown.o4">
        <p>
          ยูนิตของคุณจะสามารถเข้าปะทะกับศัตรูเพื่อโจมตีระยะใกล้ได้
        </p>
        <ul>
          <li>
            1. เลือกยูนิตได้ก็ได้ที่คุณต้องการจะให้เข้าปะทะทีละหนึ่งยูนิต และทำตามลำดับด้านล่าง
            ยูนิตที่ทำการวิ่งไปข้างหน้า
            หรือถอยหนีในรอบนี้จะไม่สามารถเข้าปะทะได้
            รวมไปถึงยูนิตที่อยู่ในระยะการปะทะกับศัตรูก็ไม่สามารถเข้าปะทะได้เช่นกัน
          </li>
          <li>
            2. เลือกยูนิตศัตรูหนึ่งยูนิตขึ้นไปเพื่อเป็นเป้าหมายในการเข้าปะทะ
          </li>
          <li>
            ทอย 2D6 ผลลัพท์ที่ได้จะเป็นระยะทางที่ยูนิตของคุณจะสามารถวิ่งเข้าปะทะได้
            ถ้าผลลัพท์ที่ได้เพียงพอต่อการขยับยูนิตของคุณไปในระยะ 1" ของทุกเป้าหมายได้ การเข้าปะทะนั้นประสบความสำเร็จ
            ให้ขยับโมเดลแต่ละตัวเข้าไปใกล้ยูนิตนั้น พยายามให้ฐานของโมเดลติดกันให้มากที่สุดเท่าที่จะเป็นไปได้เมื่อขยับเสร็จ
          </li>
        </ul>
      </div>
    </section>

    <section>
      <h3 @click="shown.o5 = !shown.o5">
        5. ช่วงต่อสู้ - Fight Phase
        <ion-icon v-if="shown.o5" name="caret-down-outline"></ion-icon>
        <ion-icon v-else name="caret-up-outline"></ion-icon>
      </h3>
      <div v-if="shown.o5">
        <p>
          ทุกยูนิตที่อยู่ในระยะการปะทะจะเริ่มต่อสู้กัน ยูนิตที่ทำการเข้าปะทะในรอบนี้จะได้ต่อสู้ก่อน
          หลังจากนั้นสลับให้ผู้เล่นที่ไม่ได้เล่นในรอบนี้ต่อสู้กลับ ผู้เล่นจะสลับกันต่อสู้ด้วยยูนิตของตัวเอง
        </p>
        <ul>
          <li>
            <strong>1. รุมเข้า - Pile In</strong> <br>
            ก่อนอื่นให้คุณขยับโมเดลไปหาโมเดลศัตรูที่อยู่ใกล้ที่สุดได้มากที่สุด 3"
          </li>
          <li>
            <strong>2. เริ่มโจมตี - Make Attacks</strong> <br>
            แต่ละโมเดลที่อยู่ในระยะปะทะกับศัตรู (หรือฐานติดกับโมเดลฝ่ายเดียวกันที่อยู่ในระยะนั้น)
            จะต่อสู้ด้วยอาวุธระยะใกล้ที่คุณเลือกมาจากอาวุธที่สวมใส่มา
            หลังจากนั้นทำตามลำดับการต่อสู้เดียวกันกับการโจมตีระยะไกล (โดยการโจมตีระยะใกล้นั้นจะใช้ WS - ทักษะการใช้อาวุธ -
            Weapon Skill แทน BS)
          </li>
          <li>
            <strong>3. รวมตัว - Consolidate</strong> <br>
            หลังจากที่ทุกยูนิตต่อสู้กันเสร็จแล้ว คุณสามารถขยับโมเดลที่ฐานไม่ติดกับศัตรูเข้าไปหาศัตรูที่อยู่ใกล้ที่สุด
            โดยขยับได้มากสุด 3"
          </li>
        </ul>
      </div>
    </section>


    <section>
      <h3 @click="shown.o6 = !shown.o6">
        ความสามารถที่พบบ่อย - Common Abilities
        <ion-icon v-if="shown.o6" name="caret-down-outline"></ion-icon>
        <ion-icon v-else name="caret-up-outline"></ion-icon>
      </h3>
      <div v-if="shown.o6">
        <p>
          ต่อไปนี้จะเป็นความสามารถที่มักพบบ่อยในยูนิต หรืออาวุธต่าง ๆ โดยคำอธิบายฉบับเต็มสำหรับความสามารถที่เลือกมานี้
          รวมไปถึงความสามารถอื่น ๆ สามารถดูเพิ่มเติมได้ที่กฏหลัก
        </p>
        <ul>
          <li>
            <strong>จุดจบสุดสยอง - Deadly Demise</strong> <br>
            จุดจบสุดสยอง X: เมื่อโมเดลที่มีความสามารถนี้ถูกทำลาย ทอย D6 หนึ่งลูก ถ้าได้ผลลัพท์เท่ากับ 6 ยูนิตที่ในระยะ 6"
            จะได้รับบาดเจ็บถึงชีวิต (Mortal Wound) เท่ากับ X
          </li>
          <li>
            <strong>โจมตีทะลุทะลวง - Deep Strike</strong> <br>
            ยูนิตจะสามารถอยู่ในกองหนุน (Reserve) แทนที่จะอยู่ในสนามรบได้ในตอนจัดทัพ <br>
            ยูนิตจะสามารถจะสามารถลงสนามรบได้ในช่วงเคลื่อนที่ของคุณ โดยจะต้องอยู่ห่างจากโมเดลศัตรูทุกตัวเป็นระยะ 9"
            นิ้วจากแนวราบ
          </li>
          <li>
            <strong>ไม่รู้จักความเจ็บปวด - Feel No Pain</strong> <br>
            ไม่รู้จักความเจ็บปวด X+: ทุกครั้งที่โมเดลที่มีความสามารถนี้จะได้รับความเจ็บปวด ทอย D6 หนึ่งลูก
            ถ้าได้ผลลัพท์มากกว่าหรือเท่ากับ X ความเจ็บปวดนั้นจะหายไป
          </li>
          <li>
            <strong>สู้ก่อน - Fight First</strong> <br>
            ยูนิตที่มีความสามารถนี้จะได้ต่อสู้ในช่วงต่อสู้ก่อน
          </li>
          <li>
            <strong>นักแทรกซึม - Infiltrators</strong> <br>
            ถ้าทุกโมเดลของยูนิตมีความสามารถนี้ ในช่วงเตรียมพล (Deployment) คุณสามารถนำยูนิตนี้ไปวางที่ไหนก็ได้ในสนามรบ
            โดยต้องห่างเป็นระยะ 9" จากจุดเตรียมพลของศัตรู รวมไปถึงโมเดลของศัตรู
          </li>
          <li>
            <strong>ผู้นำ - Leader</strong> <br>
            ตัวละคร (Character) บางยูนิตจะมี "ผู้นำ" เขียนไว้ในตารางข้อมูล ตัวละครเหล่านี้จะถือว่าเป็นผู้นำ
            และยูนิตที่ตัวละครเหล่านี้นำได้จะถูกเรียกว่าบอดี้การ์ดและกำหนดไว้ในตารางข้อมูลเช่นเดียวกัน <br>
            - ก่อนเริ่มสงคราม
            ยูนิตตัวละครที่มีความสามารถเป็นผู้นำจะสามารถรวมกับยูนิตที่เป็นบอดี้การ์ดเพื่อจะกลายเป็นยูนิตผสม (Attached
            Unit) <br>
            - ยูนิตผสมจะสามารถมีผู้นำได้เพียงหนึ่งยูนิต <br>
            - การโจมตีจะไม่สามารถจัดสรรไปที่ตัวละครที่อยู่ในยูนิตผสมได้
          </li>
          <li>
            <strong>นักลุยเดี่ยว - Lone Operative</strong> <br>
            ยูนิตนี้จะไม่สามารถถูกโจมตีได้ ถ้าหากโมเดลที่โจมตีมาอยู่ไกลกว่า 12" ความสามารถนี้จะไม่มีผลหากอยู่ในยูนิตผสม
          </li>
          <li>
            <strong>ลาดตระเวน - Scouts</strong> <br>
            - ลาดตระเวน X": ก่อนรอบแรกเริ่มขึ้น ยูนิตนี้สามารถเดินปกติได้ไกล X"
            - ถ้ายูนิตอยู่ในยานพาหนะโดยเฉพาะ (Dedicated Transport) ยานพาหนะนั้นสามารถเดินแทนได้
            - เมื่อขยับเสร็จต้องอยู่ห่างจากโมเดลศัตรูมากกว่า 9"
          </li>
          <li>
            <strong class="green">ต่อต้าน - Anti</strong> <br>
            <span class="green">[ต่อต้าน-คำสำคัญ-X]"</span>: หากเป้าหมายมีคำสำคัญเหมือนกับคำสำคัญที่เขียนไว้
            เมื่อทอยบาดเจ็บได้มากกว่าหรือเท่ากับ X โดยไม่มีการปรับเปลี่ยนหมายความว่าเป้าหมายนั้นจะบาดเจ็บอย่างรุนแรง
          </li>
          <li>
            <strong class="green">จู่โจม - Assault</strong> <br>
            โมเดลที่ถืออาวุธนี้จะสามารถยิงได้แม้ว่ารอบนี้ได้ทำการวิ่งไปข้างหน้า
          </li>
          <li>
            <strong class="green">ระเบิด - Blast</strong> <br>
            - เพิ่มจำนวนการโจมตี 1 ครั้ง สำหรับทุก 5 โมเดลในยูนิตเป้าหมายนั้น (ปัดลง)
            - ไม่สามารถใช้โจมตียูนิตที่อยู่ในระยะปะทะกับยูนิตใดก็ตามที่มาจากทัพของผู้ใช้อาวุธนี้ได้ (รวมไปถึงผู้ใช้เอง)
          </li>
          <li>
            <strong class="green">บาดแผลฉกรรจ์ - Devastrating Wound</strong> <br>
            การบาดเจ็บอย่างรุนแรงจะทำความเสียหายเป็นการบาดเจ็บถึงชีวิตเท่ากับความเสียหายของอาวุธนี้
            แทนที่จะเป็นความเสียหายธรรมดา
          </li>
          <li>
            <strong class="green">อาวุธหนัก - Heavy</strong> <br>
            หากผู้ใช้อาวุธนี้ไม่ได้ขยับไปไหนในรอบนี้ อาวุธนี้จะเพิ่มจำนวนการทอยโดนอีก 1
          </li>
          <li>
            <strong class="green">ทะลุกำแพง - Ignore Cover</strong> <br>
            ทุกครั้งที่อาวุธนี้โจมตี เป้าหมายจะไม่ได้รับประโยชน์จากการหลบหลังกำแพง (Benefit of Cover) (หน้า 44)
          </li>
          <li>
            <strong class="green">อาวุธหนัก - Heavy</strong> <br>
            หากผู้ใช้อาวุธนี้ไม่ได้ขยับไปไหนในรอบนี้ อาวุธนี้จะเพิ่มจำนวนการทอยโดนอีก 1
          </li>
          <li>
            <strong class="green">ยิงอ้อม - Indirect Fire</strong> <br>
            - สามารถเลือกเป้าหมายแม้จะมองไม่เห็นยูนิตนั้นได้
            - ถ้ามองไม่เห็นโมเดลใดเลย ในตอนที่ทำการโจมตีด้วยอาวุธนี้ ลบจำนวนทอยโดน 1 จำนวนการยิงนั้น
            และเป้าหมายจะได้ประโยชน์จากการหลบหลังกำแพง
          </li>
          <li>
            <strong class="green">โจมตีถึงชีวิต - Lethal Hits</strong> <br>
            ทุกครั้งที่อาวุธนี้โจมตี การโจมตีที่โดนจุดสำคัญจะทำให้เป้าหมายบาดเจ็บทันที
          </li>
          <li>
            <strong class="green">ปืนพก - Pistol</strong> <br>
            - สามารถยิงได้แม้ว่าผู้ใช้จะอยู่ในระยะปะทะกับยูนิตศัตรู
            แต่เมื่อโจมตีสามารถเลือกได้แต่ยูนิตที่อยู่ในระยะปะทะเท่านั้น
            - ไม่สามารถใช้ยิงพร้อมกับยิงอาวุธที่ไม่ใช้ปืนพกได้ (ยกเว้นยิงโดยสัตว์ประหลาด (Monster) หรือ พาหนะ (Vehicle))
          </li>
          <li>
            <strong class="green">ยิงรัว X - Rapid Fire X</strong> <br>
            เพิ่มจำนวนโจมตี X เมื่อเลือกเป้าหมายที่มีระยะห่างน้อยกว่าครึ่งหนึ่งของระยะโจมตีของอาวุธนี้
          </li>
          <li>
            <strong class="green">ทำร้ายต่อเนื่อง X - Sustained Hits X</strong> <br>
            ทุกครั้งที่มีการโจมตีนี้โดนจุดสำคัญ เพิ่มจำนวนการทอยบาดเจ็บ X จำนวน
          </li>
          <li>
            <strong class="green">สายน้ำ - Torrent</strong> <br>
            ทุกครั้งที่อาวุธนี้โจมตี การโจมตีโดยเป้าหมายอัตโนมัติ
          </li>
          <li>
            <strong class="green">ยิงคู่ - Twin-Linked</strong> <br>
            ทุกครั้งที่อาวุธนี้โจมตี คุณสามารถทอยบาดเจ็บได้ใหม่
          </li>
        </ul>
      </div>
    </section>
  </div>
</template>

<script setup>
import { ref } from 'vue';

const shown = ref({
  o1: false,
  o2: false,
  o3: false,
  o4: false,
  o5: false,
  o6: false
})
</script>

<style scoped>
header {
  background-image: url(https://wallpaper-mania.com/wp-content/uploads/2018/09/High_resolution_wallpaper_background_ID_77700664419.jpg);
}

h1 {
  text-align: center;
  margin: .5em 0;
}

h3 {
  background-color: #a21217;
  padding: 0 .5em;
  margin-bottom: 1em;
  display: flex;
  align-items: center;
  justify-content: space-between;
}

h4 {
  padding: 0 .5em;
}

section {
  background-color: #242526;
  margin-bottom: 1em;
}

ul {
  padding: 0 .5em;
  margin-left: 2em;
  margin-bottom: 1em;
}

ul:last-child {
  padding-bottom: 1em;
}

strong {
  text-decoration: underline;
  text-decoration-color: #a21217;
  text-decoration-thickness: 2px;
  color: var(--white) !important
}

thead {
  background-color: #516765;
  font-weight: bold;
}

table {
  width: 100%;
  border-collapse: collapse;
}

span {
  color: #516765;
}

td {
  text-align: center;
}

.leftAlign {
  text-align: left;
}

td {
  padding: .5em;
}

.red {
  font-weight: bold;
  color: #a21217;
}

.green {
  text-decoration-color: #38525a;
  color: #38525a
}
</style>